package yong_joom각사용법;

public class A_배열 {
//	
//	*1차원 배열*
//	
	// 새로운 객체배열을 만들어야할때 new 를 써야함
	
//	2가지의 특징이있다
//	
//	1) 길이가 정해져있다. (길이가 한번 정해졌으면 바꿀수없다.)
//	2) 순차적으로 사용한다.
//
//	선언 방법 int[] ref = new int[5];     // 길이가 5인 int형 1차원 배열의 생성문
//	
//	타입이 같은 둘 이상의 데이터를 저장할 수 있는 1차원 구조의 메모리 공간
//	
//	int i;
//
//	int sum = 0;
//
//	int grade[3];        // 길이가 3인 int형 배열 선언  
//
//	 
//
//	/* 배열의 초기화 */
//
//	grade[0] = 85;       // 국어 점수
//
//	grade[1] = 65;       // 영어 점수
//
//	grade[2] = 90;       // 수학 점수  
//
//	 
//
//	for (i = 0; i < 3; i++)
//
//	{
//
//	    sum += grade[i]; // 인덱스를 이용한 배열의 접근
//
//	}  
//
//	printf("국영수 과목 총 점수 합계는 %d점이고, 평균 점수는 %f점입니다.\n", sum, (double)sum/3);  
//
//	
//	
//	실행 결과
//	국영수 과목 총 점수 합계는 240점이고, 평균 점수는 80.000000점입니다.

}
