package Array1차원;

import java.util.Scanner;

public class A05_공넣기10810번 {

	public static void main(String[] args) {
		Scanner sc = new Scanner(System.in);
		
		int N = sc.nextInt(); // 도현이는 바구니를 총 N개 가지고있고
		//바구니에는 1번부터 N번까지의 번호가 있다
		//가장 처음 바구니에는 공이 들어있지 않으며, 바구니에는 공을 1개만 넣을 수 있다.
		
		int[] num = new int[N]; // 배열
		
		int M = sc.nextInt(); //도현이는 앞으로 M번 공을 넣으려고 한다
		//도현이는 한 번 공을 넣을 때, 공을 넣을 바구니 범위를 정하고
		//정한 바구니에 모두 같은 번호가 적혀있는 공을 넣는다
		//만약, 바구니에 공이 이미 있는 경우에는 들어있는 공을 빼고, 새로 공을 넣는다
		//공을 넣을 바구니는 연속되어 있어야 한다
		//공을 어떻게 넣을지가 주어졌을 때,
		//M번 공을 넣은 이후에 각 바구니에 어떤 공이 들어 있는지 구하는 프로그램을 작성하시오.
		
		// N = 공을 넣을 바구니의 범위
		// M = 몇번 공을 바구니에 넣었는지
		
		// 방법은 세 정수 i j k로 이루어져 있으며, 
		// i번 바구니부터 j번 바구니까지에 k번 번호가 적혀져 있는 공을 넣는다는 뜻이다
		
		
		
		
	}

}
